"""
3. Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь ввёл число 3.
Считаем 3 + 33 + 333 = 369

                                           ################################################################
                                           # одна цыфирка + вторая цыфирка = я у мамы погромист

var1 = int(input('Введите число от 1 до 9\n >>> '))
var2 = var1 * 11
var3 = var1 * 111

sum = var1 + var2 + var3

print('{0} + {1} + {2} = {3}'.format(var1, var2, var3, sum))
"""
                                           #################################################################
                                                              # склеиваем строки
var1 = input('Введите положительное число\n >>> ')

var2 = var1 + var1
var3 = var1 + var2

var1 = int(var1)
var2 = int(var2)
var3 = int(var3)

sum = var1 + var2 + var3

print('{0} + {1} + {2} = {3}'.format(var1, var2, var3, sum))
