"""6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.

Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.

Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено."""

from itertools import count, cycle


for num in count():                           #a)
    if num > 10:
        break
    print(num)


some_list = [1, 2, 3, 4, 5]                   #b)
stop_value = 0

for num in cycle(some_list):
    if stop_value == 10:
        break
    print(num)
    stop_value += 1
